/******************************************************************
***
***		カメラ処理
***
***		camera.h
***
***		author: Kengo Sakai
***
*******************************************************************/
#ifndef _CAMERA_H_
#define _CAMERA_H_
/******************************************************************
インクルードファイル
*******************************************************************/

/******************************************************************
マクロ定義
*******************************************************************/


/******************************************************************
構造体またはクラス定義
*******************************************************************/
class CCamera
{
public:
	CCamera();							//コンストラクタ
	~CCamera();							//デストラクタ
	HRESULT Init (void);					//初期化処理
	void Uninit(void);						//終了処理
	void Update(void);						//更新処理

	//インライン関数
	D3DXVECTOR3 GetVecUp(void){return m_VecUp;}	//カメラの上向き取得
	D3DXVECTOR3 GetPosAt(void){return m_PosAt;}	//注視点取得
	D3DXVECTOR3 GetPosView(void){return m_PosView;}	//座標取得
	D3DXMATRIX GetViewMatrix(void) { return m_MtxView; }

private:
	D3DXMATRIX m_mtxProjection;	//プロジェクションマトリクス
	D3DXMATRIX m_MtxView;		//ビューマトリクス
	D3DXMATRIX ViewMatrixMove;
	D3DXVECTOR3 m_PosAt;	//注視点
	D3DXVECTOR3 m_VecUp;	//
	D3DXVECTOR3 m_PosView;	//カメラ位置
	float m_fRot;
};

/******************************************************************
プロトタイプ宣言
*******************************************************************/

/******************************************************************
グローバル変数
*******************************************************************/

/******************************************************************/
#endif