/******************************************************************
***
***		処理
***
***		.cpp
***
***		author: Kengo Sakai
***
*******************************************************************/

/******************************************************************
インクルードファイル
*******************************************************************/
#include "scene.h"
/******************************************************************
マクロ定義
*******************************************************************/

/******************************************************************
構造体またはクラス定義
*******************************************************************/
class CCubeCollider : public CScene
{
public:
	CCubeCollider();
	~CCubeCollider();
	void Initialize(void);
	void Uninitialize(void);
	void Update(void);
	void Draw(void);
	static CCubeCollider *Create(void);

private:
	void SetMatrix(void);
	LPD3DXMESH m_pMesh;			//メッシュ
	D3DMATERIAL9 *m_pMaterial;	//マテリアル
	LPD3DXBUFFER m_pMatBuff;		//バッファポインタ
	DWORD m_dwNumMaterials;		//要素数

	D3DXMATRIX m_mtxWorld;							//ワールドマトリクス
	D3DXMATRIX m_mtxTrans;							//変換行列
	D3DXMATRIX m_mtxRot;							//回転行列
	D3DXMATRIX m_mtxScale;							//拡大行列

	D3DXVECTOR3 m_Rot;								//
	D3DXVECTOR3 m_Scale;	
	D3DMATERIAL9 m_Material;
protected:
	D3DXVECTOR3 m_Pos;
	D3DXVECTOR3 m_Wh;
};
/******************************************************************
プロトタイプ宣言
*******************************************************************/

/******************************************************************
グローバル変数
*******************************************************************/

/******************************************************************/
