/******************************************************************
***
***		フェード処理
***
***		fade.h
***
***		author: Kengo Sakai
***
*******************************************************************/
#ifndef _FADE_H_
#define _FADE_H_
/******************************************************************
インクルードファイル
*******************************************************************/
#include "main.h"
#include "scene2D.h"
/******************************************************************
マクロ定義
*******************************************************************/

/******************************************************************
構造体またはクラス定義
*******************************************************************/
class CFade : public CScene2D
{
public:
	typedef enum
	{
		FADE_NONE = 0,
		FADE_IN,
		FADE_OUT,
		FADE_MAX
	}FADE;

	~CFade() {};										//デストラクタ
	void Initialize();								//初期化処理
	void Uninitialize(void);								//終了処理
	void Update(void);								//更新処理
	void Draw(void);								//描画処理
	static CFade *Create();
	FADE GetFadeState(void) {return FadeState;}
	D3DXCOLOR GetColor(void) { return Color; }
	void SetFade(FADE OrderFadeState) {  FadeState= OrderFadeState; }
private:
	CFade();										//コンストラクタ
protected:
	FADE FadeState;
};
/******************************************************************
プロトタイプ宣言
*******************************************************************/

/******************************************************************
グローバル変数
*******************************************************************/

/******************************************************************/
#endif
