/******************************************************************
***
***		ゲージ処理
***
***		Gauge.cpp
***
***		author: Kengo Sakai
***
*******************************************************************/

/******************************************************************
インクルードファイル
*******************************************************************/
#include "manager.h"
#include "renderer.h"

#include "gaugeBox.h"

/******************************************************************
コンストラクタ
*******************************************************************/
CGauge::CGauge()
{
}

/******************************************************************
デストラクタ
*******************************************************************/
CGauge::~CGauge()
{

}

/******************************************************************
初期化処理関数
*******************************************************************/
void CGauge::Initialize(void)
{
	Position.x = 400.0f;
	Position.y = 600.0f;
	Position.z = 0.0f;

	WidthHeight.x = NUM_Gauge;
	WidthHeight.y = 50.0f;
	WidthHeight.z = 0.0f;

	CScene2D::Initialize();
}

/******************************************************************
終了処理関数
*******************************************************************/
void CGauge::Uninitialize(void)
{
	CScene2D::Uninitialize();
}

/******************************************************************
更新処理関数
*******************************************************************/
void CGauge::Update(void)
{

}

/******************************************************************
描画処理関数
*******************************************************************/
void CGauge::Draw(void)
{
	CScene2D::Draw();
}

/******************************************************************
オブジェクト作成処理関数
*******************************************************************/
CGauge *CGauge::Create(void)
{
	CGauge *pGauge;

	//メモリの確保
	pGauge = new CGauge;

	//初期化処理
	pGauge->Initialize();

	//オブジェクトの型登録関数呼び出し
	pGauge->SetObjType(OBJTYPE_GAUGE);

	CManager::GetTextureManager()->LoadTexture(CTextureManager::TYPE_GAUGEBOX);

	//テクスチャを割り当てる
	pGauge->BindTexture(CManager::GetTextureManager()->GetTexture(CTextureManager::TYPE_GAUGEBOX));

	return pGauge;

}
