/******************************************************************
***
***		ゲージ処理
***
***		Gauge.h
***
***		author: Kengo Sakai
***
*******************************************************************/
#ifndef _Gauge_H_
#define _Gauge_H_

/******************************************************************
インクルードファイル
*******************************************************************/
#include "scene2D.h"

/******************************************************************
マクロ定義
*******************************************************************/
#define NUM_Gauge (300.0f)

/******************************************************************
構造体定義（クラス）
*******************************************************************/
class CGauge :public CScene2D
{
public:
	CGauge();			//コンストラクタ
	~CGauge();			//デストラクタ
	void Initialize(void);	//初期化処理
	void Uninitialize(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理
	static CGauge *Create(void);		//オブジェクト作成処理
private:
};

#endif