/******************************************************************
***
***		メッシュフィールド処理
***
***		MeshField.cpp
***
***		author: Kengo Sakai
***
*******************************************************************/

/******************************************************************
インクルードファイル
*******************************************************************/
#include "manager.h"
#include "renderer.h"
#include "meshField.h"

/******************************************************************
コンストラクタ
*******************************************************************/
CMeshField::CMeshField()
{

}

/******************************************************************
初期化処理関数
*******************************************************************/
void CMeshField::Initialize(void)
{
	//ステータスの初期化
	Position = D3DXVECTOR3(0.0f,0.0f,0.0f);		//座標
	Rotate = D3DXVECTOR3(0.0f,0.0f,0.0f);		//角度
	Scale = D3DXVECTOR3(1.0f,1.0f,1.0f);		//拡大率
	CMeshDraw::Initialize();
}

/******************************************************************
終了処理関数
*******************************************************************/
void CMeshField::Uninitialize(void)
{
	CMeshDraw::Uninitialize();
}

/******************************************************************
更新処理関数
*******************************************************************/
void CMeshField::Update(void)
{

}

/******************************************************************
描画処理関数
*******************************************************************/
void CMeshField::Draw(void)
{
	CMeshDraw::Draw();
}

/******************************************************************
オブジェクト作成関数
*******************************************************************/
CMeshField *CMeshField::Create(void)
{
	//オブジェクトポインタ
	CMeshField *pMeshField;

	//インスタンスの生成
	pMeshField = new CMeshField;

	//初期化処理
	pMeshField -> Initialize();

	//オブジェクトの型登録関数呼び出し
	pMeshField->SetObjType(OBJTYPE_FIELD);
	CManager::GetTextureManager()->LoadTexture(CTextureManager::TYPE_FIELD);
	pMeshField->BindTexture(CManager::GetTextureManager()->GetTexture(CTextureManager::TYPE_FIELD));
	return pMeshField;
}

/******************************************************************
位置情報取得関数
*******************************************************************/
D3DXVECTOR3 CMeshField::GetPosition(void)
{
	return Position;
}
