/******************************************************************
***
***		メッシュフィールド処理（ヘッダー）
***
***		MeshField.h
***
***		author: Kengo Sakai
***
*******************************************************************/
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_
/******************************************************************
インクルードファイル
*******************************************************************/
#include "meshDraw.h"
/******************************************************************
マクロ定義
*******************************************************************/

/******************************************************************
クラス定義
*******************************************************************/
class CMeshField : public CMeshDraw
{
public:
	CMeshField();		//コンストラクタ
	~CMeshField() {}			//デストラクタ
	void Initialize(void);		//初期化処理
	void Uninitialize(void);		//終了処理
	void Update(void);		//更新処理
	void Draw(void);		//描画処理
	static CMeshField *Create(void);	//オブジェクト作成処理
	D3DXVECTOR3 GetPosition(void);

private:

};

#endif