/******************************************************************
***
***		処理
***
***		.cpp
***
***		author: Kengo Sakai
***
*******************************************************************/

/******************************************************************
インクルードファイル
*******************************************************************/
#include "model.h"
/******************************************************************
マクロ定義
*******************************************************************/
class CScore;
class CGaugeMeter;
/******************************************************************
構造体またはクラス定義
*******************************************************************/
class CPlayer : public CModel
{
public:
	typedef enum
	{
		NONE=0,
		WALK,
		ATTACK,
		JUMP,
		DAMAGE,
		MAX
	}STATE;
	~CPlayer() {}				//コンストラクタ
	void Initialize(void);		//初期化処理関数
	void Uninitialize(void);		//終了処理
	void Update(void);		//更新処理
	void Draw(void);		//描画処理
	D3DXVECTOR3 GetPosition(void) { return Position; }
	static CPlayer *Create(void);
private:
	CPlayer();				//デストラクタ
	void Move(void);
	void HitObject(void);
	float Speed;
	STATE State;
	CScore *pScore;
	CGaugeMeter *pGauge;
	D3DXVECTOR3 CameraVector;
};

/******************************************************************
プロトタイプ宣言
*******************************************************************/

/******************************************************************
グローバル変数
*******************************************************************/

/******************************************************************/

