/******************************************************************
***
***		レンダラー処理
***
***		renderer.h
***
***		author: Kengo Sakai
***
*******************************************************************/
#ifndef _RENDERER_H_
#define _RENDERER_H_
/******************************************************************
インクルードファイル
*******************************************************************/
#include "main.h"

/******************************************************************
マクロ定義
*******************************************************************/

/******************************************************************
構造体またはクラス定義
*******************************************************************/
class CRenderer
{
public:
	CRenderer();							//コンストラクタ
	~CRenderer();							//デストラクタ
	HRESULT Init (HWND hWnd 
		, BOOL bWindow);					//初期化処理
	void Uninit(void);						//終了処理
	void Update(void);						//更新処理
	void Draw(void);						//描画処理
	void SetAlphaBlend(void);
	void SetDefaultBrend(void);
	void SetzBuff(void);
	LPDIRECT3DDEVICE9 GetDevice(void){return m_pD3DDevice;}	//デバイス情報取得関数
private:
	LPDIRECT3D9 m_pD3D;					//Direct3Dオブジェクト
	LPDIRECT3DDEVICE9 m_pD3DDevice;		//Deviceオブジェクト(描画に必要)
};

/******************************************************************
プロトタイプ宣言
*******************************************************************/

/******************************************************************
グローバル変数
*******************************************************************/

/******************************************************************/
#endif