/******************************************************************
***
***		スコア処理
***
***		score.h
***
***		author: Kengo Sakai
***		date:2017/01/23
***
*******************************************************************/
#ifndef _SCORE_H_
#define _SCORE_H_
/******************************************************************
インクルードファイル
*******************************************************************/
#include "main.h"
#include "scene.h"

class CNumber;
/******************************************************************
マクロ定義
*******************************************************************/
#define NUM_DIGIT (8)	//表示桁数

/******************************************************************
構造体もしくはクラス定義
*******************************************************************/
class CScore : public CScene
{
public:
	CScore(OBJTYPE type);						//コンストラクタ
	~CScore();						//デストラクタ

	void Initialize(void);				//初期化処理
	void Uninitialize(void);				//終了処理
	void Update(void);				//更新処理
	void Draw(void);				//描画処理

	void AddScore(int nValue);		//加算処理
	int GetScore(void);				//スコア情報取得処理
	void SubScore(int SubScore);

	static CScore *Create(OBJTYPE type);	//作成処理

private:
	CNumber * m_apNumber[NUM_DIGIT];			//数字へのポインタ
	D3DXVECTOR3 Position;					//ＸＹ座標
	int m_nScore;							//スコアの値

};


/******************************************************************
プロトタイプ宣言
*******************************************************************/

/******************************************************************
グローバル変数
*******************************************************************/

/******************************************************************/
#endif