/******************************************************************
***
***		UIの下処理
***
***		screenUIMat.h
***
***		author: Kengo Sakai
***
*******************************************************************/

/******************************************************************
インクルードファイル
*******************************************************************/
#include "scene2D.h"
/******************************************************************
クラス定義
*******************************************************************/
class CScreenUIMat :public CScene2D
{
public:
	~CScreenUIMat(){}
	void Initialize(void);
	void Uninitialize(void);
	void Update(void);
	void Draw(void);
	static CScreenUIMat *Create(void);
private:
	CScreenUIMat();
};
