/******************************************************************
***
***		UIの下処理
***
***		screenUIMat.cpp
***
***		author: Kengo Sakai
***
*******************************************************************/

/******************************************************************
インクルードファイル
*******************************************************************/
#include "screenUIMat.h"

/******************************************************************
コンストラクタ
*******************************************************************/
CScreenUIMat::CScreenUIMat()
{

}

/******************************************************************
初期化処理
*******************************************************************/
void CScreenUIMat::Initialize(void)
{
	Position = D3DXVECTOR3(0.0f, 20.0f, 0.0f);
	WidthHeight = D3DXVECTOR3(SCREEN_WIDTH, 50.0f, 0.0f);
	Color = D3DXCOLOR(0.0f, 0.0f, 0.0f, 125.0f);
	
	CScene2D::Initialize();
	CScene2D::SetColor(Color);
}

/******************************************************************
終了処理
*******************************************************************/
void CScreenUIMat::Uninitialize(void)
{
	CScene2D::Uninitialize();
}

/******************************************************************
更新処理
*******************************************************************/
void CScreenUIMat::Update(void)
{

}

/******************************************************************
描画処理
*******************************************************************/
void CScreenUIMat::Draw(void)
{
	CScene2D::Draw();
}

/******************************************************************
オブジェクト生成処理
*******************************************************************/
CScreenUIMat *CScreenUIMat::Create(void)
{
	CScreenUIMat *pScreenUIMat;

	pScreenUIMat = new CScreenUIMat;

	pScreenUIMat->Initialize();

	pScreenUIMat->BindTexture(NULL);

	pScreenUIMat->SetObjType(OBJTYPE_TIME);

	return pScreenUIMat;
}